In [5]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [11]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
 'key2' : ['one', 'two', 'one', 'two', 'one'],
 'data1' : np.random.randn(5),
 'data2' : np.random.randn(5)})

In [13]:
df.groupby('key2').mean()
df.index.values
df['data1']

0   -0.399876
1    0.082350
2    0.906367
3   -0.235118
4   -0.735312
Name: data1, dtype: float64

In [71]:
set1 = set(df['data1'])
set2 = set(df['data2'])
set1 & set2

set()

In [75]:
grouped = df['data1'].groupby(df['key1'])
d = { 
        'mean': list(grouped.mean()),
        'median': list(grouped.median()),
        'sem': list(grouped.sem())
    }
df_summary = pd.DataFrame(d)
df_summary

       mean    median       sem
0  0.055326 -0.165655  0.528606
1  0.335764  0.335764  0.172754

In [73]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()
means

key1  key2
a     one     0.165817
      two    -0.165655
b     one     0.508518
      two     0.163010
Name: data1, dtype: float64

In [74]:
means.unstack()

key2       one       two
key1
a     0.165817 -0.165655
b     0.508518  0.163010

In [12]:
means.index

MultiIndex([('a', 'one'),
            ('a', 'two'),
            ('b', 'one'),
            ('b', 'two')],
           names=['key1', 'key2'])

In [26]:
A = {1,2,3,4}
B = {1,2,7,8} 
(A & B) #A | B  #A ^ B

{1, 2}

In [27]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])
years = np.array([2005, 2005, 2006, 2005, 2006])
df['data1'].groupby([states, years]).mean()

California  2005   -0.508020
            2006   -0.474827
Ohio        2005    1.251337
            2006   -0.346849
Name: data1, dtype: float64

In [33]:
df.groupby('key1').mean()

         data1     data2
key1
a     0.001677 -0.034773
b     0.583973  1.077328

In [36]:
for name, group in df.groupby('key1'):
    print('+' + name)
    print(group)

+a
  key1 key2     data1     data2
0    a  one  0.859900 -0.708314
1    a  two -0.508020  0.229062
4    a  one -0.346849  0.374935
+b
  key1 key2     data1     data2
2    b  one -0.474827 -0.256208
3    b  two  1.642774  2.410864

In [ ]:
#Column or Subset of Columns

In [39]:
df['data1'].groupby(df['key1']).mean()

key1
a    0.001677
b    0.583973
Name: data1, dtype: float64

In [40]:
df[['data2']].groupby(df['key1']).mean()

         data2
key1
a    -0.034773
b     1.077328

In [49]:
g = df[['data1']].groupby(df['key1']) 
g.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0  0.001677  0.747599 -0.508020 -0.427434 -0.346849  0.256525
b      2.0  0.583973  1.497370 -0.474827  0.054573  0.583973  1.113373


           max
key1
a     0.859900
b     1.642774

In [ ]:
df[['data2']].groupby(df['key1']).mean()

In [ ]:
import pyodbc
REC_CNT = 0
server = 'DESKTOP-OM9UKAC' 
database = 'Cyberscope123' 
username = 'CSadmin' 
password = 'P@ssword1'  
sql_conn = pyodbc.connect('DRIVER={SQL Server};SERVER='+server+';DATABASE='+database+';UID='+username+';PWD='+ password)

#sql_conn = pyodbc.connect('Database=Cyberscope123;Data Source=DESKTOP-OM9UKAC;User ID=CSadmin;password=P@ssword1;Max Pool Size=200') 
query = "SELECT * FROM [component list]" 
df = pd.read_sql(query, sql_conn)